app/Controllers/Pages.php

SELECT *
FROM `user`
---

            $user = new User();
            $user->insert($data);
            $data['user'] = $user->findAll();

SELECT *
FROM `user`
---
    public function data() {
        // // $data = new User();
        // $user = new User();
        // $data['user'] = $user->findAll();
        // return view("Pages/list",$data);
        // // print_r($data->findAll());

        $session = session();
        if(isset($session->uname)){
            $user = new User();
            $data['user'] = $user->findAll();

SELECT *
FROM `user`
WHERE `email` = 'ankit@gmail.com'
AND `password` = 'ankit123'
 LIMIT 1
SELECT *
FROM `user`
---
    public function login() {

        $session = session();

        // echo "This is login";
        $user = new User();
        $res = $user->where('email',$this->request->getVar('email'))->
                      where('password',$this->request->getVar('password'))->first();

        if($res != null){
            $session->set('uname',$res['fname']);
            $user = new User();
            $data['user'] = $user->findAll();